import React from "react";

function page() {
  const text = `
1. الأهلية والتسجيل:
  - يجب أن يكون المستخدم قد أكمل سن 18 عامًا لاستخدام الموقع.
  - يجب على المستخدمين إنشاء حساب شخصي للمشاركة في الموقع.
  - يحق للموقع رفض طلب التسجيل أو تعليق/إنهاء عضوية المستخدم دون إبداء أسباب.

2. المحتوى المنشور:
  - يجب أن يكون المحتوى المقدم (وصفات، مقالات، تعليقات، إلخ) أصليًا وغير منتهك لأي حقوق ملكية فكرية.
  - يحق للموقع إزالة أي محتوى مخالف أو ضار دون إشعار.
  - يتحمل المستخدم المسؤولية الكاملة عن المحتوى الذي ينشره.

3. استخدام الموقع:
  - يُحظر استخدام الموقع لأي أغراض غير قانونية أو مسيئة.
  - يجب على المستخدمين احترام خصوصية وحقوق الآخرين.
  - يحق للموقع تعليق أو إنهاء وصول المستخدم في حال انتهاك هذه الشروط.

4. الخصوصية والبيانات:
  - يلتزم الموقع بسياسة الخصوصية المنشورة فيما يتعلق باستخدام بيانات المستخدمين.
  - يحق للموقع استخدام بيانات المستخدمين لأغراض التسويق والتحسين الموقع.
  - يُطلب من المستخدمين الموافقة على سياسة الخصوصية قبل إنشاء الحساب.

5. الإخلاء من المسؤولية:
  - المحتوى المقدم على الموقع هو لأغراض إعلامية فقط ولا يجب الاعتماد عليه كنصيحة طبية أو قانونية.
  - لا يتحمل الموقع أي مسؤولية عن الأضرار الناتجة عن استخدام المحتوى.

6. التغييرات والتحديثات:
  - يحتفظ الموقع بالحق في تغيير هذه الشروط والأحكام في أي وقت دون إشعار مسبق.
  - سيتم نشر أي تغييرات على الموقع، ويُعتبر استمرار استخدام الموقع موافقة على هذه التغييرات.

يرجى مراجعة هذه الشروط والأحكام بعناية قبل استخدام الموقع. إذا كان لديك أي أسئلة أو استفسارات، لا تتردد في الاتصال بفريق الدعم.
    `;

  return (
    <div className="bg-custom-gradient p-10 md:p-20">
      <h2 className="mb-5 text-2xl text-header font-bold">الشروط والأحكام:</h2>

      <p className="whitespace-pre-wrap leading-7 text-lg">{text}</p>
    </div>
  );
}

export default page;
